---
type: CircuitNamingScheme
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 6
tags: [revit-api, class]
---

# CircuitNamingScheme

`Autodesk.Revit.DB.Electrical.CircuitNamingScheme` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2021 | `public static CircuitNamingScheme Create ( Document document , string name , IList < TableCellCombinedParameterData > data )` |
| Method | GetCombinedParameters | 2021 | `public IList < TableCellCombinedParameterData > GetCombinedParameters ()` |
| Method | IsNameUnique | 2021 | `public static bool IsNameUnique ( Document aDocument , string name )` |
| Method | IsValidCombinedParameters | 2021 | `public static bool IsValidCombinedParameters ( Document aDocument , IList < TableCellCombinedParameterData > data )` |
| Method | SetCombinedParameters | 2021 | `public void SetCombinedParameters ( IList < TableCellCombinedParameterData > data )` |
| Property | Parameter | — | `` |